using UnityEngine;
using UnityEngine.SceneManagement;

public class SceneDriver : MonoBehaviour
{
	//==========================================================================//
	//	定義																		//
	//==========================================================================//

	//--------------------------------------//
	//	外部定数定義							//
	//--------------------------------------//
	//引数に設定してswitch文などで切り分けるときに用いるため
	public enum NAME_SCENE//アルファベット順にすること
	{
		MAIN,
		TITLE,
	}

	//--------------------------------------//
	//	内部定数定義							//
	//--------------------------------------//
	private const string NameMainScene	= "Main";
	private const string NameTitleScene = "Title";

	//--------------------------------------//
	//	内部変数定義							//
	//--------------------------------------//

	//==========================================================================//
	//	関数																		//
	//==========================================================================//

	//--------------------------------------//
	//	初期化処理							//
	//--------------------------------------//

	//--------------------------------------//
	//	シーン遷移							//
	//--------------------------------------//
	public void TranScene(NAME_SCENE nameTransTargetScene)
	{
		switch(nameTransTargetScene)
		{
			case NAME_SCENE.MAIN:
				SceneManager.LoadScene(NameMainScene);
				break;
			case NAME_SCENE.TITLE:
				SceneManager.LoadScene(NameTitleScene);
				break;
			default:
				break;
		}
	}

	//--------------------------------------//
	//	渡し処理								//
	//--------------------------------------//

}
